server/app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "due_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @project=Project.new project_params
        @project.user = current_user
        if @project.save

UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "Marketing Strategist9 plus some changes!!!"], ["updated_at", "2021-01-20 22:46:21.142900"], ["id", 21]]
---
    def update
        if @project.update project_params

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def find_project
        @project=Project.find params[:id]